var config = {
	roles : {
		'g1' : {
			name : '梅林',
			see : ['b2','b3']
		},
		'g2' : {
			name : '派西维尔',
			see : ['g1','b2']
		},
		'g3' : {
			name : '亚瑟的忠臣',
			see : []
		},
		'b1' : {
			name : '莫德雷德',
			see : ['b2','b3']
		},
		'b2' : {
			name : '莫甘娜',
			see : ['b1','b3']
		},
		'b3' : {
			name : '海波的爪牙',
			see : ['b1','b2']
		}
	},
	role_num : {
		5 : ['g1','g2','g3','b1','b3'],
		6 : ['g1','g2','g3','g3','b1','b2'],
		7 : ['g1','g2','g3','g3','b1','b2','b3'],
		8 : ['g1','g2','g3','g3','g3','b1','b2','b3'],
		9 : ['g1','g2','g3','g3','g3','g3','b1','b2','b3'],
		10 : ['g1','g2','g3','g3','g3','g3','b1','b2','b3','b3']
	}
}